# IsDocLvlMacro Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
MacroManager..::..IsDocLvlMacro Method
MacroManager Class See Also
---
Indicates current Macro is document level
**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPIMacros (in RevitAPIMacros.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool IsDocLvlMacro()
```

Visual Basic
---
```text
Public Function IsDocLvlMacro As Boolean
```

Visual C++
---
```text
public:
bool IsDocLvlMacro()
```

# ### Return Value
Returns true if is document level, false otherwise.
# See Also
MacroManager Class
Autodesk.Revit.DB.Macros Namespace